espressif/esp-idf/examples/ethernet/basic/sdkconfig.ci.defaults_esp32s31
CONFIG_IDF_TARGET="esp32s31"

CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_ESP32_EMAC=y
